tutorials/incompressible/pisoFoam/les/pitzDailyMapped/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type                mapped;
        value               uniform (0 0 0 0 0 0 0 0 0);
        interpolationScheme cell;
        setAverage          false;
        average             (0 0 0 0 0 0 0 0 0);
    }

    outlet
    {
        type                inletOutlet;
        inletValue          uniform (0 0 0 0 0 0 0 0 0);
        value               uniform (0 0 0 0 0 0 0 0 0);
    }

    upperWall
    {
        type                zeroGradient;
    }

    lowerWall
    {
        type                zeroGradient;
    }

    frontAndBack
    {
        type                empty;
    }
}

// ************************************************************************* //
